arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/scg/fsl_scg_hal.c
/* * Copyright (c) 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_scg_hal.h"
#if FSL_FEATURE_SOC_SCG_COUNT

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_GetSystemClockFreq
 * Description   : This function gets the SCG system clock frequency, these
 * clocks are used for core, platform, external and bus clock domains.
 *
 *END*************************************************************************/
uint32_t SCG_HAL_GetSystemClockFreq(SCG_Type * base,
                                      scg_system_clock_type_t type)
{
    uint32_t freq;
    uint32_t regValue;
    scg_system_clock_src_t src = SCG_HAL_GetSystemClockSrc(base);

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(type < SCG_SYSTEM_CLOCK_MAX);
#endif

    switch(src)
    {
        case SCG_SYSTEM_CLOCK_SRC_SYS_OSC:
            freq = SCG_HAL_GetSysOscFreq(base);
            break;
        case SCG_SYSTEM_CLOCK_SRC_SIRC:
            freq = SCG_HAL_GetSircFreq(base);
            break;
        case SCG_SYSTEM_CLOCK_SRC_FIRC:
            freq = SCG_HAL_GetFircFreq(base);
            break;
        case SCG_SYSTEM_CLOCK_SRC_SYS_PLL:
            freq = SCG_HAL_GetSysPllFreq(base);
            break;
        default:
            freq = 0U;
            break;
    }

    regValue = base->CSR;
    regValue = (regValue & SCG_CSR_DIVCORE_MASK) >> SCG_CSR_DIVCORE_SHIFT;
    freq /= (regValue + 1U);

    switch(type)
    {
        case SCG_SYSTEM_CLOCK_CORE:
            /* Intentionally left blank */
            break;
        case SCG_SYSTEM_CLOCK_PLAT:
            regValue = base->CSR;
            regValue = (regValue & SCG_CSR_DIVPLAT_MASK) >> SCG_CSR_DIVPLAT_SHIFT;
            freq /= (regValue + 1U);
            break;
        case SCG_SYSTEM_CLOCK_BUS:
            regValue = base->CSR;
            regValue = (regValue & SCG_CSR_DIVBUS_MASK) >> SCG_CSR_DIVBUS_SHIFT;
            freq /= (regValue + 1U);
            break;
        case SCG_SYSTEM_CLOCK_SLOW:
            regValue = base->CSR;
            regValue = (regValue & SCG_CSR_DIVSLOW_MASK) >> SCG_CSR_DIVSLOW_SHIFT;
            freq /= (regValue + 1U);
            break;
        default:
            freq = 0U;
            break;
    }

    return freq;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_SetSystemClockConfig
 * Description   : This function sets the system configuration for the specified mode.
 *
 *END*************************************************************************/
void SCG_HAL_SetSystemClockConfig(SCG_Type * base,
                                  scg_system_clock_mode_t mode,
                                  scg_system_clock_config_t const *config)
{
    uint32_t value = (uint32_t)((((uint32_t)(config->src)     << SCG_CSR_SCS_SHIFT)     & SCG_CSR_SCS_MASK)     |
                                (((uint32_t)(config->divCore) << SCG_CSR_DIVCORE_SHIFT) & SCG_CSR_DIVCORE_MASK) |
                                (((uint32_t)(config->divPlat) << SCG_CSR_DIVPLAT_SHIFT) & SCG_CSR_DIVPLAT_MASK) |
                                (((uint32_t)(config->divBus)  << SCG_CSR_DIVBUS_SHIFT)  & SCG_CSR_DIVBUS_MASK)  |
                                (((uint32_t)(config->divSlow) << SCG_CSR_DIVSLOW_SHIFT) & SCG_CSR_DIVSLOW_MASK) );

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(mode != SCG_SYSTEM_CLOCK_MODE_CURRENT);
#endif

    switch (mode)
    {
        case SCG_SYSTEM_CLOCK_MODE_RUN:       /*!< Run mode.                */
            base->RCCR = value;
            break;
        case SCG_SYSTEM_CLOCK_MODE_VLPR:      /*!< Very Low Power Run mode. */
#ifdef DEV_ERROR_DETECT
            DEV_ASSERT((SCG_SYSTEM_CLOCK_SRC_SYS_OSC == config->src) ||
                       (SCG_SYSTEM_CLOCK_SRC_SIRC    == config->src));
#endif
            base->VCCR = value;
            break;
        case SCG_SYSTEM_CLOCK_MODE_HSRUN:     /*!< High Speed Run mode.     */
            base->HCCR = value;
            break;
        default:
            break;
    }
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_GetSystemClockConfig
 * Description   : This function gets the system configuration for the specified mode.
 *
 *END*************************************************************************/
void SCG_HAL_GetSystemClockConfig(SCG_Type * base,
                                  scg_system_clock_mode_t mode,
                                  scg_system_clock_config_t *config)
{
    uint32_t value;

    switch (mode)
    {
        case SCG_SYSTEM_CLOCK_MODE_CURRENT:   /*!< Current mode.            */
            value = base->CSR;
            break;
        case SCG_SYSTEM_CLOCK_MODE_RUN:       /*!< Run mode.                */
            value = base->RCCR;
            break;
        case SCG_SYSTEM_CLOCK_MODE_VLPR:      /*!< Very Low Power Run mode. */
            value = base->VCCR;
            break;
        case SCG_SYSTEM_CLOCK_MODE_HSRUN:     /*!< High Speed Run mode.     */
            value = base->HCCR;
            break;
        default:
            value = 0U;
            break;
    }

