arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/scg/fsl_scg_hal.c
    config->src     = (scg_system_clock_src_t)
                      ((value & SCG_CSR_SCS_MASK)     >> SCG_CSR_SCS_SHIFT);
    config->divCore = (scg_system_clock_div_t)
                      ((value & SCG_CSR_DIVCORE_MASK) >> SCG_CSR_DIVCORE_SHIFT);
    config->divPlat = (scg_system_clock_div_t)
                      ((value & SCG_CSR_DIVPLAT_MASK) >> SCG_CSR_DIVPLAT_SHIFT);
    config->divBus  = (scg_system_clock_div_t)
                      ((value & SCG_CSR_DIVBUS_MASK)  >> SCG_CSR_DIVBUS_SHIFT);
    config->divSlow = (scg_system_clock_div_t)
                      ((value & SCG_CSR_DIVSLOW_MASK) >> SCG_CSR_DIVSLOW_SHIFT);
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_GetSysOscDefaultConfig
 * Description   : This function gets the default system OSC configuration.
 *
 *END*************************************************************************/
void SCG_HAL_GetSysOscDefaultConfig(scg_sosc_config_t *config)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(config);
#endif

    config->enableInStop      = false;
    config->enableInLowPower  = false;
    config->enableErClk       = false;

    config->monitorMode       = SCG_SOSC_MONITOR_DISABLE;
    config->locked            = false;

    config->div1              = SCG_ASYNC_CLOCK_DISABLE;
    config->div2              = SCG_ASYNC_CLOCK_DISABLE;

    config->extRef            = SCG_SOSC_REF_EXT;
    config->gain              = SCG_SOSC_GAIN_LOW;
    config->range             = SCG_SOSC_RANGE_LOW;
    config->initialize        = true;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_InitSysOsc
 * Description   : This function enables the SCG system OSC clock according
 * to the configuration.
 *
 *END*************************************************************************/
scg_status_t SCG_HAL_InitSysOsc(SCG_Type * base,
                                  scg_sosc_config_t const *config)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(config);
    /* Control register can be written. */
    DEV_ASSERT(!BITBAND_ACCESS32(&(base->SOSCCSR), SCG_SOSCCSR_LK_SHIFT));
#endif

    /* If clock is used by system, return error. */
    if (BITBAND_ACCESS32(&(base->SOSCCSR), SCG_SOSCCSR_SOSCSEL_SHIFT))
    {
        return STATUS_SCG_BUSY;
    }

    /* Disable monitor, disable clock and clear error. */
    base->SOSCCSR = SCG_SOSCCSR_SOSCERR_MASK;

    /* Now start to set up OSC clock. */
    /* Step 1. Setup dividers. */
    base->SOSCDIV = SCG_SOSCDIV_SOSCDIV1(config->div1) |
                    SCG_SOSCDIV_SOSCDIV2(config->div2);
    /* Step 2. Set OSC configuration. */
    base->SOSCCFG = SCG_SOSCCFG_RANGE(config->range)        |
                    SCG_SOSCCFG_HGO(config->gain)           |
                    SCG_SOSCCFG_EREFS(config->extRef);
    /* Step 3. Enable clock. */
    base->SOSCCSR = SCG_SOSCCSR_SOSCEN(1U)                         |
                    SCG_SOSCCSR_SOSCSTEN(config->enableInStop)     |
                    SCG_SOSCCSR_SOSCLPEN(config->enableInLowPower) |
                    SCG_SOSCCSR_SOSCERCLKEN(config->enableErClk);
    /* Step 4. Enable monitor. */
    base->SOSCCSR = (base->SOSCCSR
                      & ~(SCG_SOSCCSR_SOSCCM_MASK   |
                          SCG_SOSCCSR_SOSCCMRE_MASK |
                          SCG_SOSCCSR_SOSCERR_MASK))
                      |   (uint32_t)config->monitorMode;


    /* Step 5. Lock Control Status Register. */
    BITBAND_ACCESS32(&(base->SOSCCSR), SCG_SOSCCSR_LK_SHIFT) = config->locked;

    g_xtal0ClkFreq = config->freq;
    return STATUS_SCG_SUCCESS;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_DeinitSysOsc
 * Description   : Disables the SCG System OSC clock.
 *
 *END*************************************************************************/
scg_status_t SCG_HAL_DeinitSysOsc(SCG_Type * base)
{
    /* If clock is used by system, return error. */
    if (BITBAND_ACCESS32(&(base->SOSCCSR), SCG_SOSCCSR_SOSCSEL_SHIFT))
    {
        return STATUS_SCG_BUSY;
    }

    /* Clear LK bit field */
    BITBAND_ACCESS32(&(base->SOSCCSR), SCG_SOSCCSR_LK_SHIFT) = 0;

    /* Clear SOSCCSR */
    base->SOSCCSR = SCG_SOSCCSR_SOSCERR_MASK;

    g_xtal0ClkFreq = 0U;

    return STATUS_SCG_SUCCESS;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_GetSysOscFreq
 * Description   : Get SCG System OSC clock frequency (SYSOSC).
 *
 *END*************************************************************************/
uint32_t SCG_HAL_GetSysOscFreq(SCG_Type * base)
{
    if (BITBAND_ACCESS32(&(base->SOSCCSR), SCG_SOSCCSR_SOSCVLD_SHIFT)) /* System OSC clock is valid. */
    {
        return g_xtal0ClkFreq;
    }
    else
    {
        return 0U;
    }
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_GetSysOscAsyncFreq
 * Description   : Get SCG asynchronous clock frequency from system OSC.
 *
 *END*************************************************************************/
uint32_t SCG_HAL_GetSysOscAsyncFreq(SCG_Type * base,
                                      scg_async_clock_type_t type)
{
    uint32_t oscFreq = SCG_HAL_GetSysOscFreq(base);
    uint32_t divider = 0U;
    uint32_t regValue;

    /* Get divider. */
    if (oscFreq)
    {
        switch (type)
        {
            case SCG_ASYNC_CLOCK_DIV2:
                regValue = base->SOSCDIV;
                regValue = (regValue & SCG_SOSCDIV_SOSCDIV2_MASK) >> SCG_SOSCDIV_SOSCDIV2_SHIFT;
                divider = regValue;
                break;
            case SCG_ASYNC_CLOCK_DIV1:
                regValue = base->SOSCDIV;
                regValue = (regValue & SCG_SOSCDIV_SOSCDIV1_MASK) >> SCG_SOSCDIV_SOSCDIV1_SHIFT;
                divider = regValue;
                break;
            default:
                /* Invalid type */
                break;
        }
    }
    if (divider)
    {
        return (oscFreq >> (divider-1U));
    }
    else  /* Output disabled. */
    {
        return 0U;
    }
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_GetSircDefaultConfig
 * Description   : This function gets the default SIRC configuration.
 *
 *END*************************************************************************/
void SCG_HAL_GetSircDefaultConfig(scg_sirc_config_t *config)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(config);
#endif

    config->enableInStop      = false;
    config->enableInLowPower  = true;
    config->locked            = false;
    config->div1              = SCG_ASYNC_CLOCK_DISABLE;
    config->div2              = SCG_ASYNC_CLOCK_DISABLE;
    config->range             = SCG_SIRC_RANGE_HIGH;
    config->initialize        = true;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_InitSirc
 * Description   : This function enables the SCG SIRC clock according
 * to the configuration.
 *
 *END*************************************************************************/
scg_status_t SCG_HAL_InitSirc(SCG_Type * base,
                                const scg_sirc_config_t *config)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(config);
    /* Control register can be written. */
    DEV_ASSERT(!BITBAND_ACCESS32(&(base->SIRCCSR), SCG_SIRCCSR_LK_SHIFT));
#endif

    /* If clock is used by system, return error. */
    if (BITBAND_ACCESS32(&(base->SIRCCSR), SCG_SIRCCSR_SIRCSEL_SHIFT))
    {
        return STATUS_SCG_BUSY;
    }

