arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/scg/fsl_scg_hal.c
    /* Disable clock. */
    BITBAND_ACCESS32(&(base->SIRCCSR), SCG_SIRCCSR_SIRCEN_SHIFT) = 0;

    /* Now start to set up SIRC clock. */
    /* Step 1. Setup dividers. */
    base->SIRCDIV = SCG_SIRCDIV_SIRCDIV1(config->div1) |
                    SCG_SIRCDIV_SIRCDIV2(config->div2);
    /* Step 2. Set SIRC configuration. */
    base->SIRCCFG = SCG_SIRCCFG_RANGE(config->range);
    /* Step 3. Enable clock. */
    base->SIRCCSR = SCG_SIRCCSR_SIRCEN(1U)                                 |
                    SCG_SIRCCSR_SIRCSTEN(config->enableInStop     ? 1: 0 ) |
                    SCG_SIRCCSR_SIRCLPEN(config->enableInLowPower ? 1: 0 );
    /* Step 4. Lock Control Status Register.  */
    BITBAND_ACCESS32(&(base->SIRCCSR), SCG_SIRCCSR_LK_SHIFT) = config->locked;

    return STATUS_SCG_SUCCESS;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_DeinitSirc
 * Description   : Disables the SCG slow IRC.
 *
 *END*************************************************************************/
scg_status_t SCG_HAL_DeinitSirc(SCG_Type * base)
{
    /* If clock is used by system, return error. */
    if (BITBAND_ACCESS32(&(base->SIRCCSR), SCG_SIRCCSR_SIRCSEL_SHIFT))
    {
        return STATUS_SCG_BUSY;
    }

    /* Clear LK bit field */
    BITBAND_ACCESS32(&(base->SIRCCSR), SCG_SIRCCSR_LK_SHIFT) = 0;

    /* Clear SIRCCSR */
    base->SIRCCSR = 0;

    return STATUS_SCG_SUCCESS;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_GetSircFreq
 * Description   : Get SCG SIRC clock frequency.
 *
 *END*************************************************************************/
uint32_t SCG_HAL_GetSircFreq(SCG_Type * base)
{
    if (BITBAND_ACCESS32(&(base->SIRCCSR), SCG_SIRCCSR_SIRCVLD_SHIFT)) /* SIRC is valid. */
    {
        return BITBAND_ACCESS32(&(base->SIRCCFG), SCG_SIRCCFG_RANGE_SHIFT) ?
               FSL_FEATURE_SCG_SIRC_HIGH_RANGE_FREQ : FSL_FEATURE_SCG_SIRC_LOW_RANGE_FREQ;
    }
    else
    {
        return 0U;
    }
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_GetSircAsyncFreq
 * Description   : Get SCG asynchronous clock frequency from SIRC.
 *
 *END*************************************************************************/
uint32_t SCG_HAL_GetSircAsyncFreq(SCG_Type * base,
                                      scg_async_clock_type_t type)
{
    uint32_t sircFreq = SCG_HAL_GetSircFreq(base);
    uint32_t divider = 0U;
    uint32_t regValue;

    /* Get divider. */
    if (sircFreq)
    {
        switch (type)
        {
            case SCG_ASYNC_CLOCK_DIV2:
                regValue = base->SIRCDIV;
                regValue = (regValue & SCG_SIRCDIV_SIRCDIV2_MASK) >> SCG_SIRCDIV_SIRCDIV2_SHIFT;
                divider = regValue;
                break;
            case SCG_ASYNC_CLOCK_DIV1:
                regValue = base->SIRCDIV;
                regValue = (regValue & SCG_SIRCDIV_SIRCDIV1_MASK) >> SCG_SIRCDIV_SIRCDIV1_SHIFT;
                divider = regValue;
                break;
            default:
                /* Invalid type */
                break;
        }
    }
    if (divider)
    {
        return (sircFreq >> (divider-1U));
    }
    else  /* Output disabled. */
    {
        return 0U;
    }
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_GetFircDefaultConfig
 * Description   : This function gets the default FIRC configuration.
 *
 *END*************************************************************************/
void SCG_HAL_GetFircDefaultConfig(scg_firc_config_t *config)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(config);
#endif

    config->enableInStop      = false;
    config->enableInLowPower  = false;
    config->regulator         = true;
    config->enableTrim        = false;
    config->updateTrim        = false;
    config->locked            = false;

    config->div1              = SCG_ASYNC_CLOCK_DISABLE;
    config->div2              = SCG_ASYNC_CLOCK_DISABLE;

    config->range             = SCG_FIRC_RANGE_48M;

    config->trimCoar          = 0U;
    config->trimFine          = 0U;
    config->initialize        = true;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_InitFirc
 * Description   : This function enables the SCG FIRC clock according
 * to the configuration.
 *
 *END*************************************************************************/
scg_status_t SCG_HAL_InitFirc(SCG_Type * base,
                                const scg_firc_config_t *config)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(config);
    /* Control register can be written. */
    DEV_ASSERT(!BITBAND_ACCESS32(&(base->FIRCCSR), SCG_FIRCCSR_LK_SHIFT));
#endif

    /* If clock is used by system, return error. */
    if (BITBAND_ACCESS32(&(base->FIRCCSR), SCG_FIRCCSR_FIRCSEL_SHIFT))
    {
        return STATUS_SCG_BUSY;
    }

    /* Disable clock. */
    BITBAND_ACCESS32(&(base->FIRCCSR), SCG_FIRCCSR_FIRCEN_SHIFT) = 0;
    /* Disable trimming. */
    BITBAND_ACCESS32(&(base->FIRCCSR), SCG_FIRCCSR_FIRCTREN_SHIFT) = 0;
    /* Clear error. */
    BITBAND_ACCESS32(&(base->FIRCCSR), SCG_FIRCCSR_FIRCERR_SHIFT) = 1;

    /* Now start to set up FIRC clock. */
    /* Step 1. Setup dividers. */
    base->FIRCDIV = SCG_FIRCDIV_FIRCDIV1(config->div1) |
                    SCG_FIRCDIV_FIRCDIV2(config->div2);

    /* Step 2. Set FIRC configuration. */
    base->FIRCCFG = SCG_FIRCCFG_RANGE(config->range);

    /* Step 3. Set trimming configuration. */
    if (config->enableTrim)
    {
        BITBAND_ACCESS32(&(base->FIRCCSR), SCG_FIRCCSR_FIRCTRUP_SHIFT) = config->updateTrim?1:0;
        BITBAND_ACCESS32(&(base->FIRCCSR), SCG_FIRCCSR_FIRCTREN_SHIFT) = config->enableTrim?1:0;

        if (!config->updateTrim)
        {
            (void) (config->trimCoar);
            (void) (config->trimFine);
            /* The folowing code generates a HardFault exception.
            base->FIRCSTAT = SCG_FIRCSTAT_TRIMCOAR(config->trimCoar) |
                             SCG_FIRCSTAT_TRIMFINE(config->trimFine);
            */
        }
    }
    /* Step 4. Enable clock. */
    base->FIRCCSR = (base->FIRCCSR
                   & ~((SCG_FIRCCSR_FIRCEN_MASK)   |
                       (SCG_FIRCCSR_FIRCSTEN_MASK) |
                       (SCG_FIRCCSR_FIRCLPEN_MASK) |
                       (SCG_FIRCCSR_FIRCREGOFF_MASK)))
                   | (SCG_FIRCCSR_FIRCEN(1U)                                 |
                      SCG_FIRCCSR_FIRCSTEN(config->enableInStop     ? 1: 0 ) |
                      SCG_FIRCCSR_FIRCLPEN(config->enableInLowPower ? 1: 0 ) |
                      SCG_FIRCCSR_FIRCREGOFF(config->regulator ? 0: 1 ));



    /* Step 5. Lock Control Status Register  */
    BITBAND_ACCESS32(&(base->FIRCCSR), SCG_FIRCCSR_LK_SHIFT) = config->locked;
    
