arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/scg/fsl_scg_hal.c
    /* Check if an error was detected with the trimming */
    if ((config->enableTrim) && BITBAND_ACCESS32(&(base->FIRCCSR), SCG_FIRCCSR_FIRCERR_SHIFT))
    {
        return STATUS_SCG_FAILED;
    }

    return STATUS_SCG_SUCCESS;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_DeinitFirc
 * Description   : Disables the SCG fast IRC.
 *
 *END*************************************************************************/
scg_status_t SCG_HAL_DeinitFirc(SCG_Type * base)
{
    /* If clock is used by system, return error. */
    if (BITBAND_ACCESS32(&(base->FIRCCSR), SCG_FIRCCSR_FIRCSEL_SHIFT))
    {
        return STATUS_SCG_BUSY;
    }

    /* Clear LK bit field */
    BITBAND_ACCESS32(&(base->FIRCCSR), SCG_FIRCCSR_LK_SHIFT) = 0;

    /* Clear FIRCCSR */
    base->FIRCCSR = SCG_FIRCCSR_FIRCERR_MASK;

    return STATUS_SCG_SUCCESS;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_GetFircFreq
 * Description   : Get SCG FIRC clock frequency.
 *
 *END*************************************************************************/
uint32_t SCG_HAL_GetFircFreq(SCG_Type * base)
{
    static const uint32_t fircFreq[] = {
        FSL_FEATURE_SCG_FIRC_FREQ0,
        FSL_FEATURE_SCG_FIRC_FREQ1,
        FSL_FEATURE_SCG_FIRC_FREQ2,
        FSL_FEATURE_SCG_FIRC_FREQ3,
    };

    if (BITBAND_ACCESS32(&(base->FIRCCSR), SCG_FIRCCSR_FIRCVLD_SHIFT)) /* FIRC is valid. */
    {
        uint32_t regValue = base->FIRCCFG;
        regValue = (regValue & SCG_FIRCCFG_RANGE_MASK) >> SCG_FIRCCFG_RANGE_SHIFT;
        return fircFreq[regValue];
    }
    else
    {
        return 0U;
    }
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_GetFircAsyncFreq
 * Description   : Get SCG asynchronous clock frequency from FIRC.
 *
 *END*************************************************************************/
uint32_t SCG_HAL_GetFircAsyncFreq(SCG_Type * base,
                                      scg_async_clock_type_t type)
{
    uint32_t fircFreq = SCG_HAL_GetFircFreq(base);
    uint32_t divider = 0U;
    uint32_t regValue;

    /* Get divider. */
    if (fircFreq)
    {
        switch (type)
        {
            case SCG_ASYNC_CLOCK_DIV2:
                regValue = base->FIRCDIV;
                regValue = (regValue & SCG_FIRCDIV_FIRCDIV2_MASK) >> SCG_FIRCDIV_FIRCDIV2_SHIFT;
                divider = regValue;
                break;
            case SCG_ASYNC_CLOCK_DIV1:
                regValue = base->FIRCDIV;
                regValue = (regValue & SCG_FIRCDIV_FIRCDIV1_MASK) >> SCG_FIRCDIV_FIRCDIV1_SHIFT;
                divider = regValue;
                break;
            default:
                /* Invalid type */
                break;
        }
    }
    if (divider)
    {
        return (fircFreq >> (divider-1U));
    }
    else  /* Output disabled. */
    {
        return 0U;
    }
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_GetSysPllDefaultConfig
 * Description   : This function gets the default system PLL configuration.
 *
 *END*************************************************************************/
void SCG_HAL_GetSysPllDefaultConfig(scg_spll_config_t *config)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(config);
#endif

    config->enableInStop   = false;
    config->monitorMode    = SCG_SPLL_MONITOR_DISABLE;
    config->locked         = false;

    config->div1           = SCG_ASYNC_CLOCK_DISABLE;
    config->div2           = SCG_ASYNC_CLOCK_DISABLE;

    config->prediv         = 0;
    config->mult           = 0;
    config->initialize     = true;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_InitSysPll
 * Description   : This function enables the SCG system PLL clock according
 * to the configuration.
 *
 *END*************************************************************************/
scg_status_t SCG_HAL_InitSysPll(SCG_Type * base,
                                scg_spll_config_t const *config)
{
    uint32_t srcFreq;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(config);
    /* Control register can be written. */
    DEV_ASSERT(!BITBAND_ACCESS32(&(base->SPLLCSR), SCG_SPLLCSR_LK_SHIFT));
#endif

    /* If clock is used by system, return error. */
    if (BITBAND_ACCESS32(&(base->SPLLCSR), SCG_SPLLCSR_SPLLSEL_SHIFT))
    {
        return STATUS_SCG_BUSY;
    }

    /* Get clock source frequency. */
    srcFreq = SCG_HAL_GetSysOscFreq(base);

    if (!srcFreq)
    {
        return STATUS_SCG_INVALID_SRC;
    }

    /* Pre-divider checking. */
    srcFreq /= (config->prediv + SCG_SPLL_PREDIV_BASE);

    if ((srcFreq < SCG_SPLL_REF_MIN) || (srcFreq > SCG_SPLL_REF_MAX))
    {
        return STATUS_SCG_INVALID_PARAMETER;
    }

    /* Disable monitor, disable clock and clear error. */
    base->SPLLCSR = SCG_SPLLCSR_SPLLERR_MASK;

    /* Now start to set up PLL clock. */
    /* Step 1. Setup dividers. */
    base->SPLLDIV = SCG_SPLLDIV_SPLLDIV1(config->div1) |
                    SCG_SPLLDIV_SPLLDIV2(config->div2);
    /* Step 2. Set PLL configuration. */
    base->SPLLCFG = SCG_SPLLCFG_PREDIV(config->prediv)  |
                    SCG_SPLLCFG_MULT(config->mult);
    /* Step 3. Enable clock. */
    base->SPLLCSR = SCG_SPLLCSR_SPLLEN(1U)                     |
                    SCG_SPLLCSR_SPLLSTEN(config->enableInStop);
    /* Step 4. Enable monitor. */
    base->SPLLCSR = (base->SPLLCSR
                      & ~(SCG_SPLLCSR_SPLLCM_MASK   |
                          SCG_SPLLCSR_SPLLCMRE_MASK |
                          SCG_SPLLCSR_SPLLERR_MASK))
                      |   (uint32_t)config->monitorMode;

    /* Step 5. Lock Control Status Register */
    BITBAND_ACCESS32(&(base->SPLLCSR), SCG_SPLLCSR_LK_SHIFT) = config->locked;

    return STATUS_SCG_SUCCESS;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_DeinitSysPll
 * Description   : Disables the SCG system PLL.
 *
 *END*************************************************************************/
scg_status_t SCG_HAL_DeinitSysPll(SCG_Type * base)
{
    /* If clock is used by system, return error. */
    if (BITBAND_ACCESS32(&(base->SPLLCSR), SCG_SPLLCSR_SPLLSEL_SHIFT))
    {
        return STATUS_SCG_BUSY;
    }

