arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/scg/fsl_scg_hal.c
    /* Clear LK bit field */
    BITBAND_ACCESS32(&(base->SPLLCSR), SCG_SPLLCSR_LK_SHIFT) = 0;

    /* Clear SPLLCSR */
    base->SPLLCSR = SCG_SPLLCSR_SPLLERR_MASK;

    return STATUS_SCG_SUCCESS;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_GetSysPllFreq
 * Description   : Get SCG system PLL clock frequency.
 *
 *END*************************************************************************/
uint32_t SCG_HAL_GetSysPllFreq(SCG_Type * base)
{
    uint32_t freq;
    uint32_t regValue;

    if (BITBAND_ACCESS32(&(base->SPLLCSR), SCG_SPLLCSR_SPLLVLD_SHIFT)) /* System PLL is valid. */
    {
        /* Get System OSC. frequency. */
        freq = SCG_HAL_GetSysOscFreq(base);

        if (freq) /* If source is valid. */
        {
            regValue = base->SPLLCFG;
            regValue = (regValue & SCG_SPLLCFG_PREDIV_MASK) >> SCG_SPLLCFG_PREDIV_SHIFT;
            freq /= (regValue + SCG_SPLL_PREDIV_BASE);  /* Pre-divider. */

            regValue = base->SPLLCFG;
            regValue = (regValue & SCG_SPLLCFG_MULT_MASK) >> SCG_SPLLCFG_MULT_SHIFT;
            freq *= (regValue + SCG_SPLL_MULT_BASE);      /* Multiplier. */
            
            freq = freq >> 1U;  /* Divide VCO by 2. */
        }

        return freq;
    }
    else
    {
        return 0U;
    }
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_GetSysPllAsyncFreq
 * Description   : Get SCG asynchronous clock frequency from system PLL.
 *
 *END*************************************************************************/
uint32_t SCG_HAL_GetSysPllAsyncFreq(SCG_Type * base,
                                  scg_async_clock_type_t type)
{
    uint32_t pllFreq = SCG_HAL_GetSysPllFreq(base);
    uint32_t divider = 0U;
    uint32_t regValue;

    /* Get divider. */
    if (pllFreq)
    {
        switch (type)
        {
            case SCG_ASYNC_CLOCK_DIV2:
                regValue = base->SPLLDIV;
                regValue = (regValue & SCG_SPLLDIV_SPLLDIV2_MASK) >> SCG_SPLLDIV_SPLLDIV2_SHIFT;
                divider = regValue;
                break;
            case SCG_ASYNC_CLOCK_DIV1:
                regValue = base->SPLLDIV;
                regValue = (regValue & SCG_SPLLDIV_SPLLDIV1_MASK) >> SCG_SPLLDIV_SPLLDIV1_SHIFT;
                divider = regValue;
                break;
            default:
                /* Invalid type */
                break;
        }
    }
    if (divider)
    {
        return (pllFreq >> (divider-1U));
    }
    else  /* Output disabled. */
    {
        return 0U;
    }
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_SetRtcClkInFreq
 * Description   : Configures SCG RTC CLKIN clock frequency.
 *
 *END*************************************************************************/
void SCG_HAL_SetRtcClkInFreq(SCG_Type * base, uint32_t frequency)
{
    (void) (base);
    g_RtcClkInFreq = frequency;;
}

/*FUNCTION*********************************************************************
 *
 * Function Name : SCG_HAL_GetRtcClkInFreq
 * Description   : Get SCG RTC CLKIN clock frequency.
 *
 *END*************************************************************************/
uint32_t SCG_HAL_GetRtcClkInFreq(SCG_Type * base)
{
    (void) (base);
    return g_RtcClkInFreq;
}

#endif

/******************************************************************************
 * EOF
 *****************************************************************************/

